Marks100/STM32_sleepy_sensors/Src/MAIN/main.c
/* STM32 specific includes */
#ifndef UNIT_TEST
	#include "misc.h"
    #include "stm32f10x.h"
    #include "stm32f10x_rcc.h"
    #include "stm32f10x_pwr.h"
	#include "stm32f10x_i2c.h"
#endif

#include "C_defs.h"
#include "COMPILER_defs.h"
#include "COMPILER_config.h"
#include "HAL_BRD.h"
#include "HAL_ADC.h"
#include "HAL_SPI.h"
#include "HAL_I2C.h"
#include "HAL_UART.h"
#include "RFM69.h"
#include "main.h"


u16_t delay_timer = 0u;
u8_t task_timer_s = 0u;
u32_t ctr = 0u;


int main(void)
{
	ctr = 0;

	RCC_DeInit();
	SystemInit();

	RCC_HCLKConfig(RCC_SYSCLK_Div1);
	RCC_PCLK1Config(RCC_HCLK_Div1);
	RCC_PCLK2Config(RCC_HCLK_Div1);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

	/* Init the HW */
	HAL_BRD_init();
	HAL_I2C_init();
	HAL_SPI_init();

	/* Initialise the RTC */
	RTC_ext_init();

	/* Turn the LED OFF */
	HAL_BRD_set_LED( OFF );

#if( DEBUG==1)

	/* In debug mode lets init the debug usart as this consumes lots of power */
	SERIAL_init();

	/* test the delay of us_delay */
	HAL_BRD_set_LED( ON );
	delay_us(10);
	HAL_BRD_set_LED( OFF );
	delay_us(100);
	HAL_BRD_set_LED( ON );
	delay_us(1000);
	HAL_BRD_set_LED( OFF );

#else

	// ENABLE Wake Up Pin
	PWR_WakeUpPinCmd(ENABLE);

#endif

	while (1)
	{

#if(DEBUG==0)

		u32_t i = 0u;

		/* LED blink */
		for(i=0; i<2; i++)
		{
			/* Toggle LED which connected to PC13*/
			HAL_BRD_Toggle_led();
			/* delay */
			delay_us(10000);
		}

		RFM69_wakeup_and_send();

		/* Turn the LED OFF */
		HAL_BRD_set_LED( OFF );

		/* Disable the I2C peripheral to save power */
		HAL_I2C_de_init();
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1,  DISABLE);
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, DISABLE);
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, DISABLE);

		/* Enters STANDBY mode */
		PWR_EnterSTANDBYMode();

#else

		/* Handle the serial messages */
		SERIAL_msg_handler();

		if( HAL_BRD_get_rtc_trigger_status() == TRUE )
		{

			u32_t i = 0u;

			/* LED blink */
			for(i=0; i<2; i++)
			{
				/* Toggle LED which connected to PC13*/
				HAL_BRD_Toggle_led();
				/* delay */
				delay_us(10000);
			}

			RFM69_wakeup_and_send();

			/* Set the trigger back to false */
			HAL_BRD_set_rtc_trigger_status( FALSE );
		}

#endif

		if( ctr >= U32_T_MAX)
		{
			ctr = 0u;
		}
		else
		{
			ctr ++;
		}
	}
}




/* ISR for systick handler */
void SysTick_Handler( void )
{
	delay_timer--;

	task_timer_s += 1u;

	if( task_timer_s >= 20u )
	{
		/* reset the task timer */
		task_timer_s = 0u;
	}
}


u32_t get_counter( void )
{
	return ( ctr );
}


void MAIN_SYSTICK_init( void )
{
	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq (&RCC_Clocks);

	SysTick_CLKSourceConfig( SysTick_CLKSource_HCLK );

	/* Trigger an interrupt every 1ms */
	SysTick_Config(72000);
}


void delay_ms(u16_t ms)
{
	delay_timer = ms;
	while(delay_timer != 0);
}



void delay_us(u16_t us)
{
	asm volatile (	"MOV R0,%[loops]\n\t"\
			"1: \n\t"\
			"SUB R0, #1\n\t"\
			"CMP R0, #0\n\t"\
			"BNE 1b \n\t" : : [loops] "r" (9*us) : "memory"\
		      );
}





